In [2]:
data = {"State": ["Santa Catarina", "Rio de Janeiro", "Tocatins", "Bahia", "Minas Gerais"],
        "Year": [2004,2005,2006,2007,2008],
        "Unemployment Rate": [1.5, 1.7, 1.6, 2.4, 2.7]}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(data)

In [5]:
df.head()

            State  Year  Unemployment Rate
0  Santa Catarina  2004                1.5
1  Rio de Janeiro  2005                1.7
2        Tocatins  2006                1.6
3           Bahia  2007                2.4
4    Minas Gerais  2008                2.7

In [6]:
pd.DataFrame(data, columns=["State", "Unemployment Rate", "Year"])

            State  Unemployment Rate  Year
0  Santa Catarina                1.5  2004
1  Rio de Janeiro                1.7  2005
2        Tocatins                1.6  2006
3           Bahia                2.4  2007
4    Minas Gerais                2.7  2008

In [7]:
df2 = pd.DataFrame(data,
                   columns=["State", "Unemployment Rate", "Growth Rate", "Year"],
                   index = ["state1", "state2", "state3", "state4", "state5"])

In [8]:
df2

                 State  Unemployment Rate Growth Rate  Year
state1  Santa Catarina                1.5         NaN  2004
state2  Rio de Janeiro                1.7         NaN  2005
state3        Tocatins                1.6         NaN  2006
state4           Bahia                2.4         NaN  2007
state5    Minas Gerais                2.7         NaN  2008

In [9]:
df2.columns

Index(['State', 'Unemployment Rate', 'Growth Rate', 'Year'], dtype='object')

In [10]:
df2.values

array([['Santa Catarina', 1.5, nan, 2004],
       ['Rio de Janeiro', 1.7, nan, 2005],
       ['Tocatins', 1.6, nan, 2006],
       ['Bahia', 2.4, nan, 2007],
       ['Minas Gerais', 2.7, nan, 2008]], dtype=object)

In [11]:
df2.dtypes

State                 object
Unemployment Rate    float64
Growth Rate           object
Year                   int64
dtype: object

In [12]:
df2.columns

Index(['State', 'Unemployment Rate', 'Growth Rate', 'Year'], dtype='object')

In [13]:
df2["State"]

state1    Santa Catarina
state2    Rio de Janeiro
state3          Tocatins
state4             Bahia
state5      Minas Gerais
Name: State, dtype: object

In [14]:
df2[["Unemployment Rate", "Year"]]

        Unemployment Rate  Year
state1                1.5  2004
state2                1.7  2005
state3                1.6  2006
state4                2.4  2007
state5                2.7  2008

In [15]:
df2.index

Index(['state1', 'state2', 'state3', 'state4', 'state5'], dtype='object')

In [16]:
df2.filter(items= ["state2"], axis=0)

                 State  Unemployment Rate Growth Rate  Year
state2  Rio de Janeiro                1.7         NaN  2005